# Bot Commands
start_command = 'start'
help_command = 'help'
reserve_command = 'reserve'
auto_reserve_command = 'auto_reserve'
support_command = 'support'
logout_command = 'logout'

# Keyboard Texts
reserve = "رزرو غذا"
back = "← بازگشت به منوی اصلی"
restart = "شروع مجدد"
auto_reserve = "تنظیم رزرو خودکار"
lost_code = "کد فراموشی (آزمایشی)"
get_lost_code = "دریافت کد فراموشی"
send_lost_code = "ارسال کد فراموشی"
report_code = "گزارش کد فراموشی اشتباه"
set_auto_reserve = "تنظیم رزرو خودکار"
reserve_this_week = "رزرو غذای این هفته"
reserve_next_week = "رزرو غذای هفتهٔ بعد"
this_week_reserves_list = "لیست رزروهای این هفته"
next_week_reserves_list = "لیست رزروهای هفتهٔ بعد"
next_week_foods = "غذاهای هفته بعد"
this_week_foods = "غذاهای این هفته"
change_second_pass = "تغییر رمز دوم"
enable_auto_reserve = "فعال‌سازی رزرو خودکار"
disable_auto_reserve = "غیرفعال‌سازی رزرو خودکار"
changeAutoReserveDays = "تغییر تنظیمات رزرو خودکار"
show_auto_reserve_status = "نمایش اطلاعات رزرو خودکار"
support = "پشتیبانی"
my_info = "اطلاعات من"
about = "دربارهٔ ربات"
login = "ورود به ربات"
logout = "خروج"

# InlineKeyboard Texts
next_week = "هفتهٔ بعد ⏪"

# Channel Lock
join_channel = "❗ شما در کانال ما عضو نیستید\nلطفا در کانال عضو شوید و سپس مجددا امتحان کنید.\n\n✅ Channel : @{}\n\n🙂 بعد از عضویت برروی دکمه شروع مجدد کلیک کنید. "

# Signin
select_university = "دانشگاه خود را انتخاب کنید :"
send_username = "🧍🏻‍♂️ *نام کاربری* سماد رو بفرست."
send_password = "🔓 *رمز عبور* سماد رو بفرست.\n  📌 *توجه*= معمولاً رمز عبور سماد، کدملیته.\n  🗳 *نکته*= رمزت توی این ربات ذخیره نمی‌شه."

# Errors
food_not_found_for_next_week = "💢 متأسفم!\nتوی این هفته هم چیزی پیدا نکردم. می‌تونی بری به منوی اصلی، از اون‌جا به قسمت کد فراموشی بری و ببینی غذایی هست یا نه."
food_not_found_for_this_week = "💢 متأسفم!\nبرای این هفته غذایی پیدا نکردم. اگه بخوای می‌تونی با استفاده از دکمهٔ زیر، هفتهٔ بعد رو چک کنی."
unknown_command = "❌ *متوجه منظورت نشدم!*\n🔻 لطفاً از دکمه‌های ربات استفاده کن."
wrong_password = "❌ *نام کاربری یا رمز رو اشتباه فرستادی.*"
not_found = "چیزی یافت نشد!"

# Loadings
getting_information = "🔎 درحال پردازش اطلاعات ..."
getting_self_list = "بذار لیست سلف‌ها رو برات بفرستم که انتخاب کنی ..."
getting_foods = "بذار لیست غذاهارو دربیارم ..."

# Response Messages
about_message = "💡 *دربارهٔ ربات*\n🔸 این ربات توسط دانشجویان دانشگاه خواجه نصیرالدین طوسی طراحی شده. هدف این ربات فقط راحتی دانشجویان برای کار با سامانهٔ سماد دانشگاهیه.\n❤️ ارتباط با ما=\n• @Ghanbari\\_Matin\n• @Malekeym\n⭐️ لطفاً برای حمایت از ما، به این پروژه در گیت‌هاب استار بدین.\n• https=//github.com/MatinGhanbari/DiningReservation"
welcome = "👋🏻 سلام!\n🔸 به *ربات رزرو غذا دانشگاهی* خوش اومدی.\n\n🔻 برای استفاده از ربات، یکی از دکمه‌های زیر رو انتخاب کن."
select_button = "🔻 یکی از دکمه‌های زیر رو انتخاب کن."
successful_lost_code = "✅ کد فراموشی به لیست اضافه شد."
unsuccessful_lost_code = "❌ یه مشکلی پیش اومده!\n🔻 شاید غذات مشکلی داره یا شاید من مشکلی دارم. بهتره سایت سماد رو چک کنی. اگه به نظرت مشکل از منه، لطفاً به پشتیبانی پیام بده."
lost_code_not_found = "😔 متأسفم! واقعا دنیای بدی شده!\n هیچ کدی ندارم که بهت بدم. =(\n با بچه‌های دانشکده‌تون صحبت کن تا بیان توی بات کد فراموشی به اشتراک بذارن."
lost_code_found = "✅ به به! دم بچه‌های دانشکده‌تون گرم که به فکر همدیگه‌ان!\nبیا اینم کد، نوش جونت! یادت باشه بعداً برای بقیه جبران کنی. =)))"
send_wrong_lost_code = "🔻 کد فراموشی *اشتباه* رو وارد کن تا پیگیری کنم."
wrong_lost_code_sent = "👍 ممنون!\nکد فراموشی اشتباه رو گرفتم و در اولین فرصت بررسی می‌کنم."
send_support_message = "پیامتو بفرست."
support_message_sent = "ارسال شد."
successful_logout = "با موفقیت خارج شدی."
fail_logout = "از قبل خارج بودی!"
unsuccessful_operation = "یه مشکلی پیش اومد."
successful_enabled = "رزرو خودکار فعال شد."
successful_disabled = "رزرو خودکار غیرفعال شد."
choose_days = "روزهای مدنظرتو از منوی زیر انتخاب کن."
added = "اضافه شد."
removed = "حذف شد."
you_must_login = "باید اول وارد بشی."
no_reserves = "رزروی وجود نداره."
choose_your_university = "🏫 اسم دانشگاهت رو انتخاب کن."
program_not_found = "سلف برای امروز هیچ برنامهٔ غذایی‌ای نداره."
not_available = "این بخش به علت تغییرات سیستم در دسترس نیست، اما می‌تونی با مراجعه به قسمت رزرو غذا، به‌راحتی و درلحظه غذای مورد نظرت رو رزرو کنی."
help = """🍟 ربات رزرو غذای دانشگاهی\n\n🌮 برای رزرو غذا، از منوی رزرو غذا، این هفته یا هفتهٔ بعد رو انتخاب کن. بعد، اسم سلف موردنظرت رو انتخاب کن تا لیست غذاهای موجود رو ببینی. حالا با کلیک روی دکمهٔ هر غذا، در صورت داشتن موجودی کافی، رزرو در لحظه انجام می‌شه و اگر موجودیت کافی نباشه، ربات پیام عدم موجودی کافی رو برات ارسال می‌کنه. \n🔶 رزرو غذا *فوریه*؛ یعنی درجا یا برات رزرو می‌کنه یا بهت خطای مربوطه رو نشون می‌ده.\n🍖 برای دیدن لیست غذاهای رزروشده، با کلیک روی لیست رزروهای این هفته یا هفتهٔ بعد می‌تونی لیست کامل غذاهای رزرو شده‌ت رو ببینی. \n\n🦠 اگر مشکلی توی بات دیدی، از طریق آی‌دی‌هایی که در قسمت درباره هست، مشکلت رو برامون ارسال کن تا درستش کنیم.\n\n👥  با معرفی این ربات به دوستات می‌تونی خیلی به ما در توسعهٔ ربات کمک کنی."""

# Formatters Texts
self_name = "🍽️ نام سلف"
this_week_reserves = "🍟 لیست رزروهای این هفته"
next_week_reserves = "🍟 لیست رزروهای هفتهٔ بعد"
food_name = "🍕 نام غذا"
price = "💳 قیمت"
date = "📅 تاریخ"
currency = "ریال"
number = "شماره"
day = "📅 روز"
meal_type = "وعدهٔ غذایی"
your_info = """🍔 *اطلاعات تو*\n• نام= *${name} ${lastName}*\n• نام دانشگاه= *${uniName}*\n• موجودی حساب= *${credit / 10}* تومانn\n• آی‌دی= *${id}*\n• نام کاربری= *${username}*"""
auto_reserve_status = "🔸 *وضعیت رزرو خودکار*"
active = "✅ فعال"
not_active = "❌ غیرفعال"
active_days = "📅 *روزهای فعال*"
no_day = "هیچ روز"

# Tag
tag = "\n\n🍟 URB= @University\\_Reservation\\_Bot"

# General Send Messages
reserve_next_week_headsup = """🍟 *رزرو غذا هفته بعد فراموش نشه*\nشما میتوانید با زدن روی دکمه "رزرو غذای هفته بعد" غذای خود را درجا رزرو کنید."""
